OdDAI.Model.PromoteModelToReadWrite
\details
Changes the access mode for the SDAI model from the read-only to the read-write.

OdDAI.Model.RenameModel(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assigns a new name to the specified SDAI model.
\param modelName [in] A string that contains the new name of the SDAI model.